
# ====================
# set (집합자료형)
# 중복을 허용하지 않느다.
# 순서가 없다(Unordered)
# 인덱싱을 지원하지 않는다.
# ====================

# s1 = set([1,2,3])
# print(s1)       # {1, 2, 3}

# s2 = set("Hello")
# print(s2)       # {'o', 'H', 'l', 'e'}  (중복을 허용하지 않음, 순서가 없음.)

# s = set()       # 비어있는 집합 자료형 만들기

# 인덱싱으로 접근하려면 리스트나 튜플로 변환한후 해야 한다.
# s1 = set([1,2,3])
# l1 = list(s1)
# print(s1)       # {1, 2, 3}
# print(l1)       # [1, 2, 3]
# print(l1[0])    # 1
# t1 = tuple(s1)
# print(t1)       # (1, 2, 3)
# print(t1[-1])   # 3


# 교집합 구하기
# s1 = set([1, 2, 3, 4, 5, 6])
# s2 = set([4, 5, 6, 7, 8, 9])

# print(s1 & s2)              # {4, 5, 6}
# print(s1.intersection(s2))  # {4, 5, 6}
# print(s2.intersection(s1))  # {4, 5, 6}

# 합집합 구하기
# print(s1 | s2)              # {1, 2, 3, 4, 5, 6, 7, 8, 9}
# print(s1.union(s2))         # {1, 2, 3, 4, 5, 6, 7, 8, 9}


# 차집합 구하기
# print(s1 - s2)              # {1, 2, 3}
# print(s1.difference(s2))    # {1, 2, 3}
# print(s2 - s1)              # {8, 9, 7}
# print(s2.difference(s1))    # {8, 9, 7}


# ====================
# 집합 자료형 관련 함수들
# add, update, remove
# ====================

# 값 1개 추가하기 (add)
# s1 = set([1, 2, 3])
# s1.add(4)
# print(s1)       # {1, 2, 3, 4}

# 값 여러개 추가하기 (update)
# s1 = set([1, 2, 3])
# s1.update([4, 5, 6])
# print(s1)       # {1, 2, 3, 4, 5, 6}

# 특정 값 제거하기 (remove)
# s1 = set([1, 2, 3])
# s1.remove(2)
# print(s1)       # {1, 3}